# Taps
tap "homebrew/cask-fonts"
tap "yqrashawn/goku"
tap "tw93/tap"

# --- Core CLI Tools ---
brew "git"
brew "git-lfs"
brew "gh"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "jq"
brew "neovim"
brew "tmux"
brew "lazygit"
brew "yazi"
brew "tree-sitter"

# --- Shell & Config ---
brew "starship"
brew "yqrashawn/goku/goku"
brew "asdf"

# --- Dev Tools ---
brew "go"
brew "rustup"
brew "cocoapods"
brew "fastlane"
brew "swiftgen"
brew "swiftlint"
brew "xcodegen"
brew "ios-deploy"
brew "openjdk@17"
brew "awscli"
brew "ollama"
brew "mosh"

# --- Other ---
brew "aria2"
brew "neofetch"
brew "screen"
brew "pidof"
brew "redis"
brew "postgresql@14"
brew "tw93/tap/mole"
brew "gemini-cli"
brew "youtubedr"
brew "overmind"
brew "cliclick"

# --- Casks (GUI Apps) ---
cask "aerospace"
cask "ghostty"
cask "docker"
cask "maccy"
cask "stats"
cask "miniconda"
cask "ngrok"

# --- Nerd Fonts ---
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
